<?php
/**
 * Ukrainian Language File for Core Users Area (lang/ua/users.ua.lang.php)
 *
 * Core Users Area for Cotonti 0.9.26, PHP 8.4+
 * Version: 0.9.26
 * Date: Feb 15th, 2026
 * Translation adapted: webitproff, 2026 | https://github.com/webitproff
 *
 * @package Lang Cotonti
 * @copyright (c) Cotonti Team
 * @license https://github.com/Cotonti/Cotonti/blob/master/License.txt
 */
 
defined('COT_CODE') or die('Wrong URL.');

// Приклад використання апострофа без екранування:
// - $L['name'] = 'Ім’я'; правильно
// - $L['name'] = "Ім'я"; правильно (подвійні лапки)
// НЕ правильно $L['name'] = 'Ім'я';
// Екранування правильно для спецсимволів $L['name'] = 'Ім\'я'; (зворотний слеш)



/**
 * User authentication
 */
$L['users_nameormail'] = 'Ім’я або email';
$L['users_rememberme'] = 'Запам’ятати мене';
$L['users_lostpass'] = 'Відновити пароль';
$L['users_maintenance1'] = 'Сайт у режимі обслуговування';
$L['users_maintenance2'] = 'Вхід дозволено лише адміністраторам та дозволеним групам';
$L['users_loggedinas'] = 'Ви увійшли як';
$L['users_logoutfirst'] = 'Щоб увійти в інший обліковий запис, спочатку вийдіть з поточного.';

/**
 * User registration
 */
$L['users_validemail'] = 'Дійсна електронна адреса';
$L['users_validemailhint'] = '(необхідна для підтвердження реєстрації)';
$L['users_confirmpass'] = 'Підтвердити пароль';
$L['aut_contactadmin'] = 'У разі потреби зверніться до адміністратора';
$L['aut_emailalreadyindb'] = 'Така електронна адреса вже існує в базі даних';
$L['aut_emailbanned'] = 'Ця електронна адреса (або хост) заблокована. Причина: ';
$L['aut_emailtooshort'] = 'Некоректна електронна адреса';
$L['aut_invalidloginchars'] = 'Логін містить недопустимі символи';
$L['aut_logintitle'] = 'Авторизація';
$L['aut_mailnoticetitle'] = 'Зміна електронної адреси';
$L['aut_passwordmismatch'] = 'Введені паролі не збігаються';
$L['aut_passwordtooshort'] = 'Пароль має складатися з 4 або більше символів: букв, цифр та знака підкреслення';
$L['aut_registersubtitle'] = 'Заповніть реєстраційну форму відповідно до вказаних вимог';
$L['aut_registertitle'] = 'Реєстрація нового користувача';
$L['aut_regreqnoticetitle'] = 'Запит на реєстрацію нового облікового запису';
$L['aut_regrequesttitle'] = 'Реєстрація нового користувача';
$L['aut_usernamealreadyindb'] = 'Користувач із таким ім’ям уже зареєстрований у базі даних';
$L['aut_usernametooshort'] = 'Ім’я користувача має складатися з 2 або більше символів';

/**
 * User registration: messages
 */
$L['aut_regrequest'] = "Вітаємо, %1\$s,\nВаш обліковий запис наразі ще не активовано. Перш ніж ви зможете увійти, адміністратор сайту має активувати ваш обліковий запис, після чого вам надійде ще одне підтвердження.";
$L['aut_regreqnotice'] = "Цей лист надіслано вам після запиту на реєстрацію облікового запису користувача %1\$s.\nКористувач %1\$s не зможе увійти, доки його обліковий запис не буде активовано за наступним посиланням:\n%2\$s";
$L['aut_emailreg'] = "Вітаємо, %1\$s,\nВам необхідно активувати обліковий запис за допомогою наступного посилання:\n%2\$s\nЩоб скасувати активацію облікового запису, скористайтеся наступним посиланням:\n%3\$s";
$L['aut_emailchange'] = "Вітаємо, %1\$s,\nЩоб змінити вашу електронну адресу, скористайтеся наступним посиланням:\n%2\$s";

/**
 * User list
 */
$L['users_usersperpage'] = 'Користувачів на сторінку';
$L['users_usersinthissection'] = 'Усього користувачів';
$L['pro_emailandpass'] = 'Ви не можете одночасно змінювати і email, і пароль';
$L['pro_passdiffer'] = 'Введені паролі не збігаються';
$L['pro_passtoshort'] = 'Пароль має складатися з 4 або більше символів: букв, цифр та знака підкреслення';
$L['pro_subtitle'] = 'Налаштування ваших особистих даних';
$L['pro_title'] = 'Ваш обліковий запис';
$L['pro_wrongpass'] = 'Ви не ввели поточний пароль або він невірний';
$L['pro_invalidbirthdate'] = 'Неправильна дата народження';
$L['useed_accountactivated'] = 'Обліковий запис активовано';
$L['useed_email'] = 'Цей лист надіслано вам після активації вашого облікового запису. Тепер ви можете увійти на сайт, використовуючи своє ім’я користувача та пароль.';
$L['useed_subtitle'] = '&nbsp;';
$L['useed_title'] = 'Редагування';
$L['use_allbannedusers'] = 'Заблоковані облікові записи';
$L['use_allinactiveusers'] = 'Неактивовані облікові записи';
$L['use_allusers'] = 'Усі користувачі';
$L['use_byfirstletter'] = 'Імена користувачів на';
$L['use_subtitle'] = 'Зареєстровані користувачі';
$L['use_title'] = 'Користувачі';
$L['pasrec_title'] = 'Відновлення пароля';
$L['pasrec_email1'] = "Вітаємо, %1\$s,\nСкористайтеся вказаним нижче посиланням для зміни пароля:\n%2\$s\n\nУвага: якщо ви не зверталися за зміною пароля, повідомляємо, що запит зроблено %4\$s з IP-адреси %3\$s.";
$L['pasrec_email2'] = 'За вашим запитом створено новий пароль. Змініть його при першій можливості та видаліть цей лист. Ваш новий пароль: ';
$L['pasrec_explain1'] = 'Введіть вашу електронну адресу.';
$L['pasrec_explain2'] = 'Отримавши лист, скористайтеся посиланням для зміни пароля.';
$L['pasrec_explain3'] = 'Двічі підтвердивши зміну пароля, ви отримаєте лист із випадково згенерованим паролем.';
$L['pasrec_explain4'] = 'Якщо ви очистили поле для email у своєму профілі, відновити пароль самостійно ви не зможете. У такому разі надішліть лист адміністратору сайту.';
$L['pasrec_mailsent'] = 'Лист надіслано. Перевірте свою поштову скриньку та скористайтеся надісланим посиланням. Далі дотримуйтесь інструкцій для встановлення нового пароля.';
$L['pasrec_mailsent2'] = 'Пароль змінено. Перевірте, будь ласка, свою поштову скриньку через кілька хвилин, щоб отримати новий пароль.';
$L['pasrec_request'] = 'Запит';
$L['pasrec_youremail'] = 'Ваша електронна адреса: ';

/**
 * User details
 */
$L['users_sendpm'] = 'Надіслати приватне повідомлення';

/**
 * User profile & edit
 */
$L['users_id'] = 'ID користувача';
$L['users_hideemail'] = 'Приховувати email';
$L['users_myProfile'] = 'Мій профіль';
$L['users_pmnotify'] = 'Сповіщати про нові приватні повідомлення';
$L['users_pmnotifyhint'] = '(отримувати email-сповіщення при надходженні нового приватного повідомлення)';
$L['users_profileSettings'] = 'Мої налаштування';
$L['users_newpass'] = 'Встановити новий пароль';
$L['users_newpasshint1'] = '(залиште порожнім, щоб зберегти поточний)';
$L['users_newpasshint2'] = '(введіть новий пароль двічі)';
$L['users_oldpasshint'] = '(введіть свій поточний пароль, щоб встановити новий)';
$L['users_lastip'] = 'Останній IP';
$L['users_logcounter'] = 'Усього авторизацій';
$L['users_deleteuser'] = 'Видалити користувача';
$L['users_changeemail'] = 'Змінити email';

/**
 * Miscellaneous
 */
$L['users_group_not_found'] = 'Групу не знайдено';

/**
 * Moved from theme.lang
 */
$themelang['usersprofile_Emailpassword'] = 'Ваш поточний пароль';
$themelang['usersprofile_Emailnotes'] = '<p><b>Порядок зміни email (якщо дозволено адміністратором та за обов’язкового підтвердження нової адреси):</b></p><ol><li>Дія вашої поточної електронної адреси буде призупинена</li><li>З міркувань безпеки вам необхідно вказати поточний пароль для доступу до облікового запису</li><li>Для підтвердження нової адреси вам необхідно повторно активувати обліковий запис електронною поштою</li><li>До підтвердження нової адреси дія вашого облікового запису буде призупинена</li><li>Після підтвердження нової адреси ваш обліковий запис буде знову активовано</li><li>Будьте уважні при введенні нової адреси: у разі помилки ви не зможете її виправити</li><li>Якщо ви все ж припустилися помилки при введенні нової адреси, зверніться до адміністратора.</li></ol><p><b>За відсутності обов’язкового підтвердження нової адреси зміни набувають чинності негайно.</b></p>';

/**
 * Users full name display format
 */
$R['users_full_name'] = '{$lastname} {$firstname} {$middlename}';